Ludovic-Lesur/stm32l0xx-drivers/src/tim.c
/*
 * tim.c
 *
 *  Created on: 04 aug. 2024
 *      Author: Ludo
 */

#include "tim.h"

#ifndef STM32L0XX_REGISTERS_DISABLE_FLAGS_FILE
#include "stm32l0xx_registers_flags.h"
#endif
#ifndef STM32L0XX_DRIVERS_DISABLE_FLAGS_FILE
#include "stm32l0xx_drivers_flags.h"
#endif
#include "error.h"
#include "iwdg.h"
#include "math.h"
#include "nvic.h"
#include "pwr.h"
#include "rcc_reg.h"
#include "rtc.h"
#include "tim_reg.h"
#include "types.h"

/*** TIM local macros ***/

#define TIM_TIMEOUT_COUNT					10000000

#define TIM_ARR_VALUE_MIN					0x0001
#define TIM_ARR_VALUE_MAX					0xFFFF
#define TIM_CNT_VALUE_MAX					0xFFFF

#define TIM_MCH_TARGET_TRIGGER_CLOCK_HZ		2048

#define TIM_MCH_PRESCALER_ETRF_LSE			1
#define TIM_MCH_PRESCALER_PSC_LSE			((tim_clock_hz) / (TIM_MCH_TARGET_TRIGGER_CLOCK_HZ * TIM_MCH_PRESCALER_ETRF_LSE))

#define TIM_MCH_PRESCALER_ETRF_HSI			8
#define TIM_MCH_PRESCALER_PSC_HSI			((tim_clock_hz) / (TIM_MCH_TARGET_TRIGGER_CLOCK_HZ * TIM_MCH_PRESCALER_ETRF_HSI))

#define TIM_MCH_CLOCK_SWITCH_LATENCY_MS		2

#define TIM_MCH_TIMER_DURATION_MS_MIN		1
#define TIM_MCH_TIMER_DURATION_MS_MAX		((TIM_CNT_VALUE_MAX * 1000) / (tim_mch_ctx.etrf_clock_hz))

#define TIM_MCH_WATCHDOG_PERIOD_SECONDS		((TIM_MCH_TIMER_DURATION_MS_MAX / 1000) + 5)

#define TIM_CAL_INPUT_CAPTURE_PRESCALER		8
#define TIM_CAL_MEDIAN_FILTER_SIZE			9
#define TIM_CAL_CENTER_AVERAGE_SIZE			3

#define TIM_PWM_DUTY_CYCLE_PERCENT_MAX		100

/*** TIM local structures ***/

/*******************************************************************/
typedef struct {
	TIM_registers_t* peripheral;
	volatile uint32_t* rcc_enr;
	volatile uint32_t* rcc_smenr;
	uint32_t rcc_mask;
	NVIC_interrupt_t nvic_interrupt;
} TIM_descriptor_t;

/*******************************************************************/
typedef void (*TIM_irq_handler_cb_t)(TIM_instance_t instance, TIM_registers_t* peripheral);

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x01) != 0)
/*******************************************************************/
typedef struct {
	TIM_completion_irq_cb_t irq_callback;
} TIM_STD_context_t;
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
/*******************************************************************/
typedef struct {
	uint32_t duration_ms;
	TIM_waiting_mode_t waiting_mode;
	volatile uint8_t running_flag;
	volatile uint8_t irq_flag;
} TIM_MCH_channel_context_t;
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
/*******************************************************************/
typedef struct {
	RCC_clock_t clock_source;
	uint32_t etrf_clock_hz;
	TIM_MCH_channel_context_t channel[TIM_CHANNEL_LAST];
} TIM_MCH_context_t;
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x04) != 0)
/*******************************************************************/
typedef struct {
	volatile uint16_t ccr1_start;
	volatile uint16_t ccr1_end;
	volatile uint16_t capture_count;
	volatile uint8_t capture_done;
} TIM_CAL_context_t;
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x08) != 0)
/*******************************************************************/
typedef struct {
	uint32_t channels_duty_cycle;
} TIM_PWM_context_t;
#endif

/*** TIM local global variables ***/

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x0F) != 0)
static const TIM_descriptor_t TIM_DESCRIPTOR[TIM_INSTANCE_LAST] = {
	{TIM2,  &(RCC -> APB1SMENR), &(RCC -> APB1ENR), (0b1 << 0),  NVIC_INTERRUPT_TIM2},
	{TIM21, &(RCC -> APB2SMENR), &(RCC -> APB2ENR), (0b1 << 2),  NVIC_INTERRUPT_TIM21},
#if (STM32L0XX_REGISTERS_MCU_CATEGORY == 2) || (STM32L0XX_REGISTERS_MCU_CATEGORY == 3) || (STM32L0XX_REGISTERS_MCU_CATEGORY == 5)
	{TIM22, &(RCC -> APB2SMENR), &(RCC -> APB2ENR), (0b1 << 5),  NVIC_INTERRUPT_TIM22},
#endif
#if (STM32L0XX_REGISTERS_MCU_CATEGORY == 3) || (STM32L0XX_REGISTERS_MCU_CATEGORY == 5)
	{TIM6,  &(RCC -> APB1SMENR), &(RCC -> APB1ENR), (0b1 << 4),  NVIC_INTERRUPT_TIM6},
#endif
#if (STM32L0XX_REGISTERS_MCU_CATEGORY == 5)
	{TIM3,  &(RCC -> APB1SMENR), &(RCC -> APB1ENR), (0b1 << 1),  NVIC_INTERRUPT_TIM3},
	{TIM7,  &(RCC -> APB1SMENR), &(RCC -> APB1ENR), (0b1 << 5),  NVIC_INTERRUPT_TIM7},
#endif
};
#endif
#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x01) != 0)
static TIM_STD_context_t tim_std_ctx[TIM_INSTANCE_LAST];
#endif
#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
static TIM_MCH_context_t tim_mch_ctx; // Not defined as array because only supported by one instance (TIM2).
#endif
#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x04) != 0)
static TIM_CAL_context_t tim_cal_ctx; // Not defined as array because only supported by one instance (TIM21).
#endif
#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x08) != 0)
static TIM_PWM_context_t tim_pwm_ctx[TIM_INSTANCE_LAST];
#endif
static TIM_irq_handler_cb_t tim_irq_handler[TIM_INSTANCE_LAST];

/*** TIM local functions ***/

/*******************************************************************/
#define _TIM_check_instance(instance) { \
	/* Check instance */ \
	if (instance >= TIM_INSTANCE_LAST) { \
		status = TIM_ERROR_INSTANCE; \
		goto errors; \
	} \
}

/*******************************************************************/
#define _TIM_check_channel(channel) { \
	/* Check channel */ \
	if (channel >= TIM_CHANNEL_LAST) { \
		status = TIM_ERROR_CHANNEL; \
		goto errors; \
	} \
}

/*******************************************************************/
#define _TIM_irq_handler(instance, peripheral) { \
	/* Execute internal callback */ \
	if (tim_irq_handler[instance] != NULL) { \
		tim_irq_handler[instance](instance, peripheral); \
	} \
}

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x0F) != 0)
/*******************************************************************/
void __attribute__((optimize("-O0"))) TIM2_IRQHandler(void) {
	// Execute internal callback.
	_TIM_irq_handler(TIM_INSTANCE_TIM2, TIM2);
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x0F) != 0)
/*******************************************************************/
void __attribute__((optimize("-O0"))) TIM21_IRQHandler(void) {
	// Execute internal callback.
	_TIM_irq_handler(TIM_INSTANCE_TIM21, TIM21);
}
#endif

#if (((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x0F) != 0) && ((STM32L0XX_REGISTERS_MCU_CATEGORY == 2) || (STM32L0XX_REGISTERS_MCU_CATEGORY == 3) || (STM32L0XX_REGISTERS_MCU_CATEGORY == 5)))
/*******************************************************************/
void __attribute__((optimize("-O0"))) TIM22_IRQHandler(void) {
	// Execute internal callback.
	_TIM_irq_handler(TIM_INSTANCE_TIM22, TIM22);
}
#endif

#if (((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x0F) != 0) && ((STM32L0XX_REGISTERS_MCU_CATEGORY == 3) || (STM32L0XX_REGISTERS_MCU_CATEGORY == 5)))
/*******************************************************************/
void __attribute__((optimize("-O0"))) TIM6_IRQHandler(void) {
	// Execute internal callback.
	_TIM_irq_handler(TIM_INSTANCE_TIM6, TIM6);
}
#endif

#if (((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x0F) != 0) && (STM32L0XX_REGISTERS_MCU_CATEGORY == 5))
/*******************************************************************/
void __attribute__((optimize("-O0"))) TIM3_IRQHandler(void) {
	// Execute internal callback.
	_TIM_irq_handler(TIM_INSTANCE_TIM3, TIM3);
}
#endif

#if (((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x0F) != 0) && (STM32L0XX_REGISTERS_MCU_CATEGORY == 5))
/*******************************************************************/
void __attribute__((optimize("-O0"))) TIM7_IRQHandler(void) {
	// Execute internal callback.
	_TIM_irq_handler(TIM_INSTANCE_TIM7, TIM7);
}
#endif

