Ludovic-Lesur/stm32l0xx-drivers/src/tim.c
#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x01) != 0)
/*******************************************************************/
static void __attribute__((optimize("-O0"))) _TIM_STD_irq_handler(TIM_instance_t instance, TIM_registers_t* peripheral) {
	// Update interrupt.
	if (((peripheral -> SR) & (0b1 << 0)) != 0) {
		// Call callback.
		if (tim_std_ctx[instance].irq_callback != NULL) {
			tim_std_ctx[instance].irq_callback();
		}
		// Clear flag.
		peripheral -> SR &= ~(0b1 << 0);
	}
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
/*******************************************************************/
static void __attribute__((optimize("-O0"))) _TIM_MCH_irq_handler(TIM_instance_t instance, TIM_registers_t* peripheral) {
	// Local variables.
	uint8_t channel_idx = 0;
	uint8_t channel_mask = 0;
	// Unused parameter.
	UNUSED(instance);
	// Channels loop.
	for (channel_idx=0 ; channel_idx<TIM_CHANNEL_LAST ; channel_idx++) {
		// Compute mask.
		channel_mask = (0b1 << (channel_idx + 1));
		// Check flag.
		if (((peripheral -> SR) & channel_mask) != 0) {
			// Set local flag if channel is active.
			tim_mch_ctx.channel[channel_idx].irq_flag = tim_mch_ctx.channel[channel_idx].running_flag;
			// Clear flag.
			peripheral -> SR &= ~(channel_mask);
		}
	}
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
/*******************************************************************/
static void _TIM_MCH_compute_compare_value(TIM_instance_t instance, TIM_channel_t channel) {
	// Update compare value.
	TIM_DESCRIPTOR[instance].peripheral -> CCRx[channel] = ((TIM_DESCRIPTOR[instance].peripheral -> CNT) + ((tim_mch_ctx.channel[channel].duration_ms * tim_mch_ctx.etrf_clock_hz) / (1000))) % TIM_CNT_VALUE_MAX;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
/*******************************************************************/
static TIM_status_t _TIM_MCH_internal_watchdog(uint32_t time_start, uint32_t* time_reference) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	uint32_t time = RTC_get_uptime_seconds();
	// If the RTC is correctly clocked, it will be used as internal watchdog and the IWDG can be reloaded.
	// If the RTC is not running anymore due to a clock failure, the IWDG is not reloaded and will reset the MCU.
	if (time != (*time_reference)) {
		// Update time reference and reload IWDG.
		(*time_reference) = time;
		IWDG_reload();
	}
	// Internal watchdog.
	if (time > (time_start + TIM_MCH_WATCHDOG_PERIOD_SECONDS)) {
		status = TIM_ERROR_COMPLETION_WATCHDOG;
	}
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x04) != 0)
/*******************************************************************/
static void __attribute__((optimize("-O0"))) _TIM_CAL_irq_handler(TIM_instance_t instance, TIM_registers_t* peripheral) {
	// Unused parameter.
	UNUSED(instance);
	// TI1 interrupt.
	if (((peripheral -> SR) & (0b1 << 1)) != 0) {
		// Update flags.
		if (((peripheral -> DIER) & (0b1 << 1)) != 0) {
			// Check count.
			if (tim_cal_ctx.capture_count == 0) {
				// Store start value.
				tim_cal_ctx.ccr1_start = (peripheral -> CCR1);
				tim_cal_ctx.capture_count++;
			}
			else {
				// Check rollover.
				if ((peripheral -> CCR1) > tim_cal_ctx.ccr1_end) {
					// Store new value.
					tim_cal_ctx.ccr1_end = (peripheral -> CCR1);
					tim_cal_ctx.capture_count++;
				}
				else {
					// Capture complete.
					tim_cal_ctx.capture_done = 1;
				}
			}
		}
		peripheral -> SR &= ~(0b1 << 1);
	}
}
#endif

/*******************************************************************/
static TIM_status_t _TIM_CAL_single_capture(TIM_instance_t instance, int32_t* ref_clock_pulse_count, int32_t* mco_pulse_count) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	uint32_t loop_count = 0;
	// Reset timer context.
	tim_cal_ctx.ccr1_start = 0;
	tim_cal_ctx.ccr1_end = 0;
	tim_cal_ctx.capture_count = 0;
	tim_cal_ctx.capture_done = 0;
	// Reset counter.
	TIM_DESCRIPTOR[instance].peripheral -> CNT = 0;
	TIM_DESCRIPTOR[instance].peripheral -> CCR1 = 0;
	// Enable interrupt.
	TIM_DESCRIPTOR[instance].peripheral -> SR &= 0xFFFFF9B8; // Clear all flags.
	NVIC_enable_interrupt(TIM_DESCRIPTOR[instance].nvic_interrupt);
	// Enable TIM peripheral.
	TIM_DESCRIPTOR[instance].peripheral -> CR1 |= (0b1 << 0); // CEN='1'.
	TIM_DESCRIPTOR[instance].peripheral -> CCER |= (0b1 << 0); // CC1E='1'.
	// Wait for capture to complete.
	while (tim_cal_ctx.capture_done == 0) {
		// Manage timeout.
		loop_count++;
		if (loop_count > TIM_TIMEOUT_COUNT) {
			status = TIM_ERROR_CAPTURE_TIMEOUT;
			goto errors;
		}
	}
	// Update results.
	(*ref_clock_pulse_count) = (int32_t) (tim_cal_ctx.ccr1_end - tim_cal_ctx.ccr1_start);
	(*mco_pulse_count) = (int32_t) (TIM_CAL_INPUT_CAPTURE_PRESCALER * (tim_cal_ctx.capture_count - 1));
	// Disable interrupt.
	NVIC_disable_interrupt(TIM_DESCRIPTOR[instance].nvic_interrupt);
	// Stop counter.
	TIM_DESCRIPTOR[instance].peripheral -> CR1 &= ~(0b1 << 0); // CEN='0'.
	TIM_DESCRIPTOR[instance].peripheral -> CCER &= ~(0b1 << 0); // CC1E='0'.
errors:
	return status;
}

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x09) != 0)
/*******************************************************************/
static TIM_status_t _TIM_write_arr(TIM_instance_t instance, uint64_t arr) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	// Check value.
	if ((arr < TIM_ARR_VALUE_MIN) || (arr > TIM_ARR_VALUE_MAX)) {
		status = TIM_ERROR_ARR_VALUE;
		goto errors;
	}
	TIM_DESCRIPTOR[instance].peripheral -> ARR = arr;
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x0F) != 0)
/*******************************************************************/
static void _TIM_de_init(TIM_instance_t instance) {
	// Disable interrupt.
	NVIC_disable_interrupt(TIM_DESCRIPTOR[instance].nvic_interrupt);
	// Disable timer.
	TIM_DESCRIPTOR[instance].peripheral -> CR1 &= ~(0b1 << 0); // CEN='0'.
	// Disable peripheral clock.
	(*TIM_DESCRIPTOR[instance].rcc_enr) &= ~(TIM_DESCRIPTOR[instance].rcc_mask);
}
#endif

