Ludovic-Lesur/stm32l0xx-drivers/src/tim.c
#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x04) != 0)
/*******************************************************************/
TIM_status_t TIM_CAL_init(TIM_instance_t instance, uint8_t nvic_priority) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	// Check instance.
	_TIM_check_instance(instance);
	// Check supported instances.
	if (instance != TIM_INSTANCE_TIM21) {
		status = TIM_ERROR_INSTANCE;
		goto errors;
	}
	// Update local interrupt handler.
	tim_irq_handler[instance] = &_TIM_CAL_irq_handler;
	// Enable peripheral clock.
	(*TIM_DESCRIPTOR[instance].rcc_enr) |= TIM_DESCRIPTOR[instance].rcc_mask;
	(*TIM_DESCRIPTOR[instance].rcc_smenr) |= TIM_DESCRIPTOR[instance].rcc_mask;
	// Channel input on TI1, CH1 mapped on MCO and capture done every 8 edges.
	TIM_DESCRIPTOR[instance].peripheral -> CCMR1 |= (0b01 << 0) | (0b11 << 2);
	TIM_DESCRIPTOR[instance].peripheral -> OR |= (0b111 << 2);
	// Enable interrupt.
	TIM_DESCRIPTOR[instance].peripheral -> DIER |= (0b1 << 1); // CC1IE='1'.
	NVIC_set_priority(TIM_DESCRIPTOR[instance].nvic_interrupt, nvic_priority);
	// Generate event to update registers.
	TIM_DESCRIPTOR[instance].peripheral -> EGR |= (0b1 << 0); // UG='1'.
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x04) != 0)
/*******************************************************************/
TIM_status_t TIM_CAL_de_init(TIM_instance_t instance) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	// Check instance.
	_TIM_check_instance(instance);
	// Release timer.
	_TIM_de_init(instance);
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x04) != 0)
/*******************************************************************/
TIM_status_t TIM_CAL_mco_capture(TIM_instance_t instance, int32_t* ref_clock_pulse_count, int32_t* mco_pulse_count) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	MATH_status_t math_status = MATH_SUCCESS;
	int32_t ref_clock_pulse_count_buffer[TIM_CAL_MEDIAN_FILTER_SIZE] = {0x00};
	int32_t mco_pulse_count_buffer[TIM_CAL_MEDIAN_FILTER_SIZE] = {0x00};
	uint8_t idx = 0;
	// Check instance.
	_TIM_check_instance(instance);
	// Check parameters.
	if ((ref_clock_pulse_count == NULL) || (mco_pulse_count == NULL)) {
		status = TIM_ERROR_NULL_PARAMETER;
		goto errors;
	}
	// Captures loop.
	for (idx=0 ; idx<TIM_CAL_MEDIAN_FILTER_SIZE ; idx++) {
		status = _TIM_CAL_single_capture(instance, &(ref_clock_pulse_count_buffer[idx]), &(mco_pulse_count_buffer[idx]));
		if (status != TIM_SUCCESS) goto errors;
	}
	// Apply median filter.
	math_status = MATH_median_filter(ref_clock_pulse_count_buffer, TIM_CAL_MEDIAN_FILTER_SIZE, TIM_CAL_CENTER_AVERAGE_SIZE, ref_clock_pulse_count);
	MATH_exit_error(TIM_ERROR_BASE_MATH);
	math_status = MATH_median_filter(mco_pulse_count_buffer, TIM_CAL_MEDIAN_FILTER_SIZE, TIM_CAL_CENTER_AVERAGE_SIZE, mco_pulse_count);
	MATH_exit_error(TIM_ERROR_BASE_MATH);
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x08) != 0)
/*******************************************************************/
TIM_status_t TIM_PWM_init(TIM_instance_t instance, TIM_gpio_t* pins, uint32_t pwm_frequency_hz) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	uint32_t tim_clock_hz = 0;
	uint64_t arr  = 0;
	uint8_t idx = 0;
	// Check instance.
	_TIM_check_instance(instance);
	// Check parameter.
	if (pins == NULL) {
		status = TIM_ERROR_NULL_PARAMETER;
		goto errors;
	}
#if (STM32L0XX_REGISTERS_MCU_CATEGORY == 3) || (STM32L0XX_REGISTERS_MCU_CATEGORY == 5)
	// Check supported instance.
	if (instance == TIM_INSTANCE_TIM6) {
		status = TIM_ERROR_INSTANCE;
		goto errors;
	}
#endif
#if (STM32L0XX_REGISTERS_MCU_CATEGORY == 5)
	// Check supported instance.
	if (instance == TIM_INSTANCE_TIM7) {
		status = TIM_ERROR_INSTANCE;
		goto errors;
	}
#endif
	// Update local interrupt handler.
	tim_irq_handler[instance] = NULL;
	// Get clock source frequency.
	RCC_get_frequency_hz(RCC_CLOCK_SYSTEM, &tim_clock_hz);
	// Enable peripheral clock.
	(*TIM_DESCRIPTOR[instance].rcc_enr) |= TIM_DESCRIPTOR[instance].rcc_mask;
	(*TIM_DESCRIPTOR[instance].rcc_smenr) |= TIM_DESCRIPTOR[instance].rcc_mask;
	// Set PWM frequency.
	arr = (uint64_t) (tim_clock_hz / pwm_frequency_hz);
	status = _TIM_write_arr(instance, arr);
	if (status != TIM_SUCCESS) goto errors;
	// Reset counter.
	TIM_DESCRIPTOR[instance].peripheral -> CNT = 0;
	// Configure channels 1-4 in PWM mode 1 (OCxM='110' and OCxPE='1').
	TIM_DESCRIPTOR[instance].peripheral -> CCMR1 |= (0b110 << 12) | (0b1 << 11) | (0b110 << 4) | (0b1 << 3);
	TIM_DESCRIPTOR[instance].peripheral -> CCMR2 |= (0b110 << 12) | (0b1 << 11) | (0b110 << 4) | (0b1 << 3);
	TIM_DESCRIPTOR[instance].peripheral -> CR1 |= (0b1 << 7);
	// Disable all channels by default.
	tim_pwm_ctx[instance].channels_duty_cycle = 0;
	for (idx=0 ; idx<TIM_CHANNEL_LAST ; idx++) TIM_DESCRIPTOR[instance].peripheral -> CCRx[idx] = ((TIM_DESCRIPTOR[instance].peripheral -> ARR) + 1);
	TIM_DESCRIPTOR[instance].peripheral -> CCER |= 0x00001111;
	// Generate event to update registers.
	TIM_DESCRIPTOR[instance].peripheral -> EGR |= (0b1 << 0); // UG='1'.
	// Configure GPIOs.
	if ((pins -> ch1) != NULL) {
		GPIO_configure((pins -> ch1), GPIO_MODE_ALTERNATE_FUNCTION, GPIO_TYPE_PUSH_PULL, GPIO_SPEED_HIGH, GPIO_PULL_NONE);
	}
	if ((pins -> ch2) != NULL) {
		GPIO_configure((pins -> ch2), GPIO_MODE_ALTERNATE_FUNCTION, GPIO_TYPE_PUSH_PULL, GPIO_SPEED_HIGH, GPIO_PULL_NONE);
	}
	if ((pins -> ch3) != NULL) {
		GPIO_configure((pins -> ch3), GPIO_MODE_ALTERNATE_FUNCTION, GPIO_TYPE_PUSH_PULL, GPIO_SPEED_HIGH, GPIO_PULL_NONE);
	}
	if ((pins -> ch4) != NULL) {
		GPIO_configure((pins -> ch4), GPIO_MODE_ALTERNATE_FUNCTION, GPIO_TYPE_PUSH_PULL, GPIO_SPEED_HIGH, GPIO_PULL_NONE);
	}
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x08) != 0)
/*******************************************************************/
TIM_status_t TIM_PWM_de_init(TIM_instance_t instance, TIM_gpio_t* pins) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	// Check instance.
	_TIM_check_instance(instance);
	// Check parameter.
	if (pins == NULL) {
		status = TIM_ERROR_NULL_PARAMETER;
		goto errors;
	}
	// Release GPIOs.
	if ((pins -> ch1) != NULL) {
		GPIO_configure((pins -> ch1), GPIO_MODE_OUTPUT, GPIO_TYPE_PUSH_PULL, GPIO_SPEED_LOW, GPIO_PULL_NONE);
	}
	if ((pins -> ch2) != NULL) {
		GPIO_configure((pins -> ch2), GPIO_MODE_OUTPUT, GPIO_TYPE_PUSH_PULL, GPIO_SPEED_LOW, GPIO_PULL_NONE);
	}
	if ((pins -> ch3) != NULL) {
		GPIO_configure((pins -> ch3), GPIO_MODE_OUTPUT, GPIO_TYPE_PUSH_PULL, GPIO_SPEED_LOW, GPIO_PULL_NONE);
	}
	if ((pins -> ch4) != NULL) {
		GPIO_configure((pins -> ch4), GPIO_MODE_OUTPUT, GPIO_TYPE_PUSH_PULL, GPIO_SPEED_LOW, GPIO_PULL_NONE);
	}
	_TIM_de_init(instance);
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x08) != 0)
/*******************************************************************/
TIM_status_t TIM_PWM_set_duty_cycle(TIM_instance_t instance, TIM_channel_t channel, uint8_t duty_cycle_percent) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	uint32_t arr_plus_one = 0;
	// Check instance.
	_TIM_check_instance(instance);
	// Check parameters.
	_TIM_check_channel(channel);
	if (duty_cycle_percent > TIM_PWM_DUTY_CYCLE_PERCENT_MAX) {
		status = TIM_ERROR_DUTY_CYCLE;
		goto errors;
	}
	// Update duty cycle.
	tim_pwm_ctx[instance].channels_duty_cycle &= ~(0xFF << (channel << 3));
	tim_pwm_ctx[instance].channels_duty_cycle |= (duty_cycle_percent << (channel << 3));
	// Set duty cycle.
	arr_plus_one = ((TIM_DESCRIPTOR[instance].peripheral -> ARR) + 1);
	TIM_DESCRIPTOR[instance].peripheral -> CCRx[channel] = arr_plus_one - ((arr_plus_one * duty_cycle_percent) / (TIM_PWM_DUTY_CYCLE_PERCENT_MAX));
	// Check channels status.
	if (tim_pwm_ctx[instance].channels_duty_cycle == 0) {
		// Disable and reset counter.
		TIM_DESCRIPTOR[instance].peripheral -> CR1 &= ~(0b1 << 0); // CEN='0'.
		TIM_DESCRIPTOR[instance].peripheral -> CNT = 0;
	}
	else {
		// Enable counter.
		TIM_DESCRIPTOR[instance].peripheral -> CR1 |= (0b1 << 0); // CEN='1'.
	}
errors:
	return status;
}
#endif
